/*裁决公式：
JSON:{
	"name":"技能名",
	"命中判定":{
		"目标属性是":"属性名",
		"目标属性否":"属性名",
		"目标属性是率":"属性名",
		"目标属性否率":"属性名",
		"目标增益是":"增益名",
		"目标增益否":"增益名",
		"目标增益是率":"增益名",
		"目标增益否率":"增益名",
		"目标削弱是":"削弱名",
		"目标削弱是率":"削弱名",
		"目标削弱否率":"削弱名",
		"目标削弱否":"削弱名",
		"目标状态是":"状态名",
		"目标状态否":"状态名",
		"目标状态是率":"状态名",
		"目标状态否率":"状态名",
		"发起者属性是":"属性名",
		"发起者属性否":"属性名",
		"发起者属性是率":"属性名",
		"发起者属性否率":"属性名",
		"发起者增益是":"增益名",
		"发起者增益否":"增益名",
		"发起者增益是率":"增益名",
		"发起者增益否率":"增益名",
		"发起者削弱是":"削弱名",
		"发起者削弱是率":"削弱名",
		"发起者削弱否率":"削弱名",
		"发起者削弱否":"削弱名",
		"发起者状态是":"状态名",
		"发起者状态否":"状态名",
		"发起者状态是率":"状态名",
		"发起者状态否率":"状态名"
	},
	"值判决":{
		"目标属性率增":"概率属性名|属性名",
		"目标属性率减":"概率属性名|属性名",
		"目标增益率增":"概率属性名|增益名",
		"目标增益率减":"概率属性名|增益名",
		"目标削弱率增":"概率属性名|削弱名",
		"目标削弱率减":"概率属性名|削弱名",
		"目标状态率增":"概率属性名|状态名",
		"目标状态率减":"概率属性名|状态名",
		"发起者属性率增":"概率属性名|属性名",
		"发起者属性率减":"概率属性名|属性名",
		"发起者增益率增":"概率属性名|增益名",
		"发起者增益率减":"概率属性名|增益名",
		"发起者削弱率增":"概率属性名|削弱名",
		"发起者削弱率减":"概率属性名|削弱名",
		"发起者状态率增":"概率属性名|状态名",
		"发起者状态率减":"概率属性名|状态名"
	}
}

一个完整技能的JSON:
var normal_near_attack = {
	"技能名":"普通攻击(近)",
	"技能描述":"近距离普通攻击",
	"耗时":"800",

	"无效判定":{
		"无效":"无敌的",
		"等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
		"发起者属性是率":"命中率",
		"目标属性否率":"躲闪率"
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"属性影响":{
					"数值":"0d0+0", //物理伤害
					"影响":"生命值",
					"正反":-1,
					"值判决":{
								"发起者属性率增":"|伤害值",
								"发起者属性率增E":"暴击率|暴击加值",
								"目标属性率减":"格挡率|格挡值",
								"目标属性率减E":"|防御值",
							 },
					},
		"增益削弱":{
					"名字":"剥夺五感",
					"命中判定":{
									"目标属性否率":"沉默豁免"
								},
					"时间判决":{
									"目标属性率减":"意志率|意志值",
									"目标属性率减E":"|防御值",
								},
				   },
	}
};

}*/


var normal_near_attack = {
	"技能名":"普通攻击(近)",
	"技能描述":"近距离普通攻击",
	"耗时":"800",

	"无效判定":{
		"无效":"无敌的",
		"等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
		"发起者属性是率":"命中率",
		"目标属性否率":"躲闪率"
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"属性影响":{
					"数值":"0d0+0", //物理伤害
					"影响":"生命值",
					"正反":-1,
					"值判决":{
								"发起者属性率增":"|伤害值",
								"发起者属性率增E":"暴击率|暴击加值",
								"目标属性率减":"格挡率|格挡值",
								"目标属性率减E":"|防御值",
							 },
					},
	}
};


var test_skill001 = {
	"技能名":"扔石头",
	"技能描述":"扔石头打人脑袋",
	"耗时":"1100",

	"无效判定":{
		"无效":"无敌的",
		"等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
		"发起者属性是率":"命中率",
		"目标属性否率":"躲闪率"
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"属性影响":{
					"数值":"1d12+1", //物理伤害
					"影响":"生命值",
					"正反":-1,
					"值判决":{
								"发起者属性率增":"|伤害值",
								"发起者属性率增E":"暴击率|暴击加值",
								"目标属性率减":"|防御值",
							 },
					},
	}
};


var test_skill002 = {
	"技能名":"吐吐沫",
	"技能描述":"往人脸上吐吐沫",
	"耗时":"300",

	"无效判定":{
		"无效":"无敌的",
		"等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
		"发起者属性是率":"命中率",
		"目标属性否率":"躲闪率"
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"属性影响":{
					"数值":"1d6+0",
					"影响":"生命值",
					"正反":-1,
					"值判决":{
								"发起者属性率增":"|伤害值",
								"发起者属性率增E":"暴击率|暴击加值",
								"目标属性率减":"格挡率|格挡值",
								"目标属性率减E":"|防御值",
							 },
					},
	}
};

var test_skill003 = {
	"技能名":"狗急跳墙",
	"技能描述":"当自己生命垂尾时，进入急迫状态，玩命做出攻击。当生命值较多时几乎无效",
	"耗时":"1800",

	"无效判定":{
		"无效":"无敌的",
		"等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
		"发起者属性是率":"命中率",
		"目标属性否率":"躲闪率"
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"属性影响":{
					"数值":"1d90+0",
					"影响":"生命值",
					"正反":-1,
					"值判决":{
								"发起者属性率增":"暴击率|暴击加值",
								"发起者属性率减":"|生命值",
								"发起者属性率减E":"|生命值",
								"目标属性率减":"格挡率|格挡值",
								"目标属性率减E":"|防御值",
							 },
					},
	}
};

var test_skill004 = {
	"技能名":"六道轮回",
	"技能描述":"让敌人顺序通过六道轮回，造成一定伤害，并剥夺其五感，使其伤害值，防御力，命中率，格挡率都有下降",
	"耗时":"3800",

	"无效判定":{
		"无效":"无敌的",
		"等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
		"目标属性否率":"意志率"
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"属性影响":{
					"数值":"1d40+0",
					"影响":"生命值",
					"正反":-1,
					"值判决":{
								"发起者属性率增":"暴击率|暴击加值",
							 },
					},
		"增益削弱": "剥夺五感"
	}
};

var test_skill005 = {
	"技能名":"燃烧之手",
	"技能描述":"点燃敌人，使其被火焰吞没",
	"耗时":"1800",

	"无效判定":{
		"无效":"无敌的",
		"等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
		//"目标属性否率":"意志率"
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"续跳": "燃烧"
	}
};

var glass_wall = {
	"技能名":"水晶墙",
	"技能描述":"在自己身体前立一道水晶墙，提高防御力",
	"耗时":"2300",

	"无效判定":{
		"不等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"增益削弱": "防御值大幅度提升"
	}
};

var angry = {
	"技能名":"狂怒",
	"技能描述":"进入愤怒状态，攻击相关属性加强",
	"耗时":"2300",

	"无效判定":{
		"不等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"增益削弱": "攻击增强"
	}
};



var heal = {
	"技能名":"吃大肥肉",
	"技能描述":"让自己狂吃肥肉恢复生命",
	"耗时":"6800",

	"无效判定":{
		"不等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"属性影响":{
					"数值":"1d32+0",
					"影响":"生命值",
					"正反":1,
					"值判决":{
							 },
					},
	}
};

var heal_dot = {
	"技能名":"回春术",
	"技能描述":"让目标回复生命",
	"耗时":"1000",

	"无效判定":{
		"不等属性":{
			"无效":"所在组"
		},
	},

	///命中判定只能判定一次
	"命中判定":{
	},

	/// 一旦命中，就遍历作用表进行值判定
	"作用表":{
		"续跳": "恢复"
	}
};


console.log(normal_near_attack);