/*
JsonDots文件：
1.续跳模版


属性模板如下：
var example1 = {
	"名字":"燃烧",
	"描述":"每2秒一次，失去一定生命，持续10秒",
	"间隔":2000,
	"持续时间": 10000,
	"作用表":{
		"属性影响":{
					"数值":"1d3+5",
					"影响":"生命值",
					"正反":-1,
					"值判决":{
								"发起者属性率增":"|火伤加值",
								"发起者属性率增":"|魔伤加值",
							 },
					},
};


*/



var burning = {
	"名字":"燃烧",
	"描述":"每2秒一次，失去一定生命，持续10秒",
	"间隔":1000,
	"持续时间": 10000,
	"类别": "续跳",
	"作用表":{
		"属性影响":{
					"数值":"1d3+2",
					"影响":"生命值",
					"正反":-1,
					"值判决":{
								"发起者属性率增":"|火伤加值",
								"发起者属性率增":"|魔伤加值",
								"目标属性率减":"|耐高温",
							 },
					},
			},
};


var healing = {
	"名字":"恢复",
	"描述":"每3.5秒一次，回复一定生命，持续15秒",
	"间隔":3500,
	"持续时间": 15000,
	"类别": "续跳",
	"作用表":{
		"属性影响":{
					"数值":"1d4+6",
					"影响":"生命值",
					"正反":1,
					"值判决":{
								"发起者属性率增":"|魔伤加值",
							 },
					},
			},
};