/*
JsonUnits文件：
1.很重要的模板类型文件，里面包含了一个单位的所有属性json脚本是如何书写的范例
2.扩充游戏中原有单位模板的地方
str.replace(/E/ig, "");
str.replace(/E+$/ig, "");
str.replace(/[A-Z]+$/ig, "");
\w
str.replace(/[a-z0-9_]+$/ig, "");
str.replace(/\w+$/ig, "");

属性模板如下：
var example1 = {
	/// 单位描述部分，和游戏的显示有一定关系，
	/// 可以显示为 [攻城师 刘胡笳]，可以有细节描述
	"名字": "刘胡笳",						//名字，是查找对象的唯一KEY
	"称谓": "攻城师",						//称谓，具体是干什么的
	"描述": "攻城兵，负责攻城任务",			//描述，描述此单位

	/// 单位核心属性，是游戏性的最重要部分，
	/// 单位和单位之间的互动目的就是修改这些属性，
	/// 达到击杀，拯救等等目的
	"移动速度": 10,
	"生命值": 100,
	"生命值上限": 100,
	"体力值": 80,
	"体力值上限": 80,
	"伤害值": "1d12+0",
	"暴击率": "1d12+0>2d12+0",
	"暴击加值": "0d0+0",
	"暴击倍数": 1,
	"防御值": "1d3+0",
	"命中率": "1d30+50>1d50+50",
	"躲闪率": "1d6+0>2d12+0",
	"格挡值": "2d8+0",
	"格挡率": "2d8+0>2d12+0",
	"意志率": "2d6+0>2d12+0",	//对削弱状态抵抗概率
	"耐高温": "1d3+0",
	"耐低温": "1d3+0",
	"耐毒素": "1d3+0",
	"耐电压": "1d3+0",
	"行动间隔": 100,

	/// 单位状态属性，也很重要，
	/// 虽然不像核心属性影响那么大，
	/// 但是对状态属性的修改，可以达到
	/// 对单位的控制和制裁，之所以要抽离这些属性，
	/// 一是为了以后单位状态的画面显示，
	/// 二是为了对单位状态切换的控制
	"沉默豁免": "1d6+0>2d12+0",
	"昏迷豁免": "1d6+0>2d12+0",
	"恐惧豁免": "1d6+0>2d12+0",
	"战粟豁免": "1d6+0>2d12+0",
	"睡眠豁免": "1d6+0>2d12+0",
	"禁锢豁免": "1d6+0>2d12+0",

	"沉默": false,
	"昏迷": false,
	"恐惧": false,
	"战粟": false,
	"睡眠": false,
	"禁锢": false,

	/// 关系型属性
	"目标": "",
	"无敌的": true,
	"所在组": 0,

	/// 战斗状态属性
	/// 只保存名称
	"增益表":{},
	"削弱表":{},
	"续跳表":{},
};

*/

/// 个体<刘胡笳>
var GANDOF_ATTRIBUTE = {
		/// 单位描述部分，和游戏的显示有一定关系，
	/// 可以显示为 [攻城师 刘胡笳]，可以有细节描述
	"名字": "列兵",						//名字，是查找对象的唯一KEY
	"称谓": "攻城师",						//称谓，具体是干什么的
	"描述": "攻城兵，负责攻城任务",			//描述，描述此单位

	/// 单位核心属性，是游戏性的最重要部分，
	/// 单位和单位之间的互动目的就是修改这些属性，
	/// 达到击杀，拯救等等目的
	"移动速度": 10,
	"生命值": 200,
	"生命值上限": 200,
	"体力值": 80,
	"体力值上限": 80,
	"伤害值": "1d22+2",
	"暴击率": "1d12+0>2d12+0",
	"暴击加值": "1d37+0",
	"防御值": "1d3+0",
	"命中率": "1d40+60>0d0+80",
	"躲闪率": "1d6+0>2d12+0",
	"格挡值": "2d8+0",
	"格挡率": "2d8+0>2d12+0",
	"意志率": "2d6+0>2d12+0",
	"火伤加值": "1d4+0",
	"冰伤加值": "1d4+0",
	"电伤加值": "1d4+0",
	"魔伤加值": "1d4+0",
	"耐高温": "0d0+0",
	"耐低温": "0d0+0",
	"耐毒素": "0d0+0",
	"耐电压": "0d0+0",
	"行动间隔": 100,

	/// 单位状态属性，也很重要，
	/// 虽然不像核心属性影响那么大，
	/// 但是对状态属性的修改，可以达到
	/// 对单位的控制和制裁，之所以要抽离这些属性，
	/// 一是为了以后单位状态的画面显示，
	/// 二是为了对单位状态切换的控制
	"沉默": false,
	"昏迷": false,
	"恐惧": false,
	"战粟": false,
	"睡眠": false,
	"禁锢": false,

	/// 关系型属性
	"目标": "空",
	"无敌的": false,
	"所在组": 0,

	/// 战斗状态属性
	/// 只保存名称
	"增益表":[],
	"削弱表":[],
	"续跳表":[]
};

/// 个体<王明建>
var DENBLIDO_ATTRIBUTE = {
	/// 单位描述部分，和游戏的显示有一定关系，
	/// 可以显示为 [攻城师 刘胡笳]，可以有细节描述
	"名字": "阻击兵",						//名字，是查找对象的唯一KEY
	"称谓": "武器大师",						//称谓，具体是干什么的
	"描述": "操纵，教授各种武器",			//描述，描述此单位

	/// 单位核心属性，是游戏性的最重要部分，
	/// 单位和单位之间的互动目的就是修改这些属性，
	/// 达到击杀，拯救等等目的
	"移动速度": 10,
	"生命值": 200,
	"生命值上限": 200,
	"体力值": 80,
	"体力值上限": 80,
	"伤害值": "1d12+0",
	"暴击率": "1d12+0>2d12+0",
	"暴击加值": "1d12+0",
	"防御值": "1d3+0",
	"命中率": "1d40+60>0d0+80",
	"躲闪率": "1d6+0>2d12+0",
	"格挡值": "2d8+0",
	"格挡率": "2d8+0>2d12+0",
	"意志率": "2d6+0>2d12+0",
	"火伤加值": "1d4+0",
	"冰伤加值": "1d4+0",
	"电伤加值": "1d4+0",
	"魔伤加值": "1d4+0",
	"耐高温": "1d6+0",
	"耐低温": "1d4+0",
	"耐毒素": "1d4+0",
	"耐电压": "1d4+0",
	"行动间隔": 100,

	/// 单位状态属性，也很重要，
	/// 虽然不像核心属性影响那么大，
	/// 但是对状态属性的修改，可以达到
	/// 对单位的控制和制裁，之所以要抽离这些属性，
	/// 一是为了以后单位状态的画面显示，
	/// 二是为了对单位状态切换的控制
	"沉默": false,
	"昏迷": false,
	"恐惧": false,
	"战粟": false,
	"睡眠": false,
	"禁锢": false,

	/// 关系型属性
	"目标": "空",
	"无敌的": false,
	"所在组": 1,

	/// 战斗状态属性
	/// 只保存名称
	"增益表":[],
	"削弱表":[],
	"续跳表":[]
};