/*
JsonMapUnits文件：
1.描述一个map中初始单位状态
2.作为一个游戏战役的核心数据
3.包含单位名称和初始位置
4.是战役数据中单位描述部分
模板如下：
var mapunits001 = {
	"单位组001":
	[
		{
			"单位名字":"刘胡笳",
			"初始位置":[10, 12]
		},
		{
			"单位名字":"刘胡笳",
			"初始位置":[10, 11]
		},
		{
			"单位名字":"刘胡笳",
			"初始位置":[9, 10]
		},
		{
			"单位名字":"刘胡笳",
			"初始位置":[9, 11]
		},
	],
	"单位组002":
	[
		{
			"单位名字":"王明建",
			"初始位置":[4, 6]
		},
		{
			"单位名字":"王明建",
			"初始位置":[5, 6]
		},
		{
			"单位名字":"王明建",
			"初始位置":[4, 5]
		},
		{
			"单位名字":"王明建",
			"初始位置":[4, 4]
		},
	],
};
*/

var mapunits001 = {
	"单位组001":
	[
		{
			"单位名字":"德古拉墨客",
			"属性模版":GANDOF_ATTRIBUTE,
			"初始位置":[10, 12]
		},
		{
			"单位名字":"希拉蕊",
			"属性模版":GANDOF_ATTRIBUTE,
			"初始位置":[10, 11]
		},
		{
			"单位名字":"卡里罗",
			"属性模版":GANDOF_ATTRIBUTE,
			"初始位置":[9, 10]
		},
		{
			"单位名字":"刘胡笳",
			"属性模版":GANDOF_ATTRIBUTE,
			"初始位置":[9, 11]
		},
	],
	"单位组002":
	[
		{
			"单位名字":"卡斯基拉",
			"属性模版":DENBLIDO_ATTRIBUTE,
			"初始位置":[4, 6]
		},
		{
			"单位名字":"昂德",
			"属性模版":DENBLIDO_ATTRIBUTE,
			"初始位置":[5, 6]
		},
		{
			"单位名字":"杜安佛瑞",
			"属性模版":DENBLIDO_ATTRIBUTE,
			"初始位置":[4, 5]
		},
		{
			"单位名字":"王明建",
			"属性模版":DENBLIDO_ATTRIBUTE,
			"初始位置":[4, 4]
		},
	],
};