/*********
Skill类[实例化类]：
1.技能类，是一个单位对自己或另一个单位施展的技能
2.技能中有两大部分，一个是描述技能的Action行为列表，一个是描述裁决的公式

行为列表实例：
普通攻击
{
	"伤害目标":"2d6+3" //伤害值
}
攻击+削弱
{
	"伤害目标":"2d6+3" //伤害值
	"持续削弱":"dot_id"
}
治疗+增益
{
	"治疗目标":"3d4",
	"持续增益":"buf_id"
}

裁决公式：
JSON:{
	"name":"技能名",
	"命中判定":{
		"目标属性是":"属性名",
		"目标属性否":"属性名",
		"目标属性是率":"属性名",
		"目标属性否率":"属性名",
		"目标增益是":"增益名",
		"目标增益否":"增益名",
		"目标增益是率":"增益名",
		"目标增益否率":"增益名",
		"目标削弱是":"削弱名",
		"目标削弱是率":"削弱名",
		"目标削弱否率":"削弱名",
		"目标削弱否":"削弱名",
		"目标状态是":"状态名",
		"目标状态否":"状态名",
		"目标状态是率":"状态名",
		"目标状态否率":"状态名",
		"发起者属性是":"属性名",
		"发起者属性否":"属性名",
		"发起者属性是率":"属性名",
		"发起者属性否率":"属性名",
		"发起者增益是":"增益名",
		"发起者增益否":"增益名",
		"发起者增益是率":"增益名",
		"发起者增益否率":"增益名",
		"发起者削弱是":"削弱名",
		"发起者削弱是率":"削弱名",
		"发起者削弱否率":"削弱名",
		"发起者削弱否":"削弱名",
		"发起者状态是":"状态名",
		"发起者状态否":"状态名",
		"发起者状态是率":"状态名",
		"发起者状态否率":"状态名"
	},
	"值判决":{
		"目标属性率增":"概率属性名|属性名",
		"目标属性率减":"概率属性名|属性名",
		"目标增益率增":"概率属性名|增益名",
		"目标增益率减":"概率属性名|增益名",
		"目标削弱率增":"概率属性名|削弱名",
		"目标削弱率减":"概率属性名|削弱名",
		"目标状态率增":"概率属性名|状态名",
		"目标状态率减":"概率属性名|状态名",
		"发起者属性率增":"概率属性名|属性名",
		"发起者属性率减":"概率属性名|属性名",
		"发起者增益率增":"概率属性名|增益名",
		"发起者增益率减":"概率属性名|增益名",
		"发起者削弱率增":"概率属性名|削弱名",
		"发起者削弱率减":"概率属性名|削弱名",
		"发起者状态率增":"概率属性名|状态名",
		"发起者状态率减":"概率属性名|状态名"
	}
}

一个完整技能的JSON:
JSON:{
	"技能名":"人间大炮",
	"技能描述":"人间大炮开火，对目标造成3d100+20的火焰伤害，和2d50+100的物理伤害",
	"耗时":2000,
	"命中判定":{
		"目标属性否率":"dodge"
	}，
	作用表:{
		"伤害目标":{
					"数值":"3d100+20", //火焰伤害
					"值判决":{		   //没有判决因素（暂时没有火焰耐受性）
							 },
					},
		"伤害目标":{
					"数值":"3d100+20", //物理伤害
					"值判决":{
								"发起者属性率增":"crick|crickval",
								"目标属性率减":"holdr|hold",
								"目标属性率减":"|defence",
							 },
					},
	}
}


************/

/// Class Skill
Skill = Klass({
	initialize: function(dat, nam, desc){
		/// nothing to do
		this.data = dat;
		this.skill_name = nam;
		this.skill_descript = desc;
	},
});
